# SQL II: Grouping and Joining

_November 2, 2020_

Agenda:
- Practice with Grouping in SQLite
- Practice with different types of Joins in SQLite

<img src = "https://media.giphy.com/media/3oKIPnAiaMCws8nOsE/giphy.gif">

In [1]:
import sqlite3
import pandas as pd
import seaborn as sns
import numpy as np

## Part I. Grouping
Just like pandas, Sql support different types of grouping statements for performing aggregate functions and allow us to calculate various statistics for data.

Syntax:
`SELECT (*) FROM tables GROUP BY column`

In [2]:
# instantiate some data
np.random.seed(1234)

auto = pd.read_csv('auto-mpg.csv')
tips = sns.load_dataset('tips')
small_quiz = pd.DataFrame({"students":["Billy","Ijeoma","Kelvin"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_grades = pd.DataFrame({"students":["Muhammad","Joe","Kelvin"],
                            "quiz_score":np.random.randint(0,10,3)})

In [4]:
#tips.to_csv('tips.csv')

tips = pd.read_csv('tips.csv')

In [5]:
conn = sqlite3.connect('aggregate.db')
c = conn.cursor()

In [6]:
# insert these datasets into our db

#auto.to_sql('auto', con=conn)

tips.to_sql('tips', con=conn)
small_grades.to_sql('small_grade', con=conn)
small_quiz.to_sql('small_quiz',con=conn)

/Users/flee/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:2531: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype, method=method)

In [7]:
# for the tips df/table, get the total number of man and woman

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           0       16.99  1.01  Female     No  Sun  Dinner     2
1           1       10.34  1.66    Male     No  Sun  Dinner     3

sex
Female     87
Male      157
dtype: int64

Male      157
Female     87
Name: sex, dtype: int64

Syntax: `SELECT ___ FROM ___ GROUP BY ___`

In [ ]:
# in sql 
query = """"""
c.execute(query).fetchall()

In [ ]:
# using pandas, select the average amount tipped for time
pd_query = None

In [ ]:
# use sql to recreate this query
query = """"""
c.execute(query).fetchall()

We can also use `GROUP BY` with certain conditions, in conjunction with filtering and ordering.

You can use :

`SELECT ___ FROM ___ WHERE ___ GROUP BY ___ `

`SELECT ___ FROM ___ GROUP BY ___ HAVING ____ `

In [ ]:
# use pandas, get the average total bills for a party larger than 2 for every size of party

# using pandas

In [ ]:
# use sql to recreate this query
query = """"""
c.execute(query).fetchall()

In [ ]:
# your turn - use pandas, get the maximum value of total bill for female non smoker

# using group by?

In [ ]:
# Hint - you can use this with out without group by

In [ ]:
# use sql to recreate this query
query = """"""
c.execute(query).fetchall()

In [ ]:
# your turn - use pandas, get the average tip values for different size groups, and show top 2
# most amount of average tips

In [ ]:
# use sql 
query = None
c.execute(query).fetchall()

## Part II. Join

Based on this diagram, how would you explain the different types of joins?

<img src = 'sql-joins-better.png' width = 400>

In [ ]:
print(small_grades)
print(small_quiz)

In [ ]:
# left join - join small quiz with small grades, on student name

In [ ]:
# sql 
query = """SELECT * FROM small_grade LEFT JOIN small_quiz on small_grade.students = small_quiz.students"""
c.execute(query).fetchall()
col = [i[0] for i in c.description]

In [ ]:
# inner join and get the student's grades
small_grades.merge(small_quiz, on = 'students')

In [ ]:
query = """SELECT * FROM small_quiz JOIN small_grade ON small_grade.students = small_quiz.students"""
c.execute(query).fetchall()

In [ ]:
# your turn - use right join and get all entries

# pandas

In [ ]:
# sql

### Level up 
1. Subqueries (including anti-joins)
2. Get median (using OFFSET)

In [ ]:
# anti-join :get all the entries that are in the left table but not in the right table 
query = """SELECT left_table.id FROM `left table` WHERE left_table.id not in (SELECT id FROM right_table) """

In [ ]:
# get median - use offset 
query = """SELECT col FROM table ORDER BY col LIMIT 1 OFFSET (SELECT COUNT(*) FROM MyTable) / 2"""